#ASSIGNMENT 3

1. Import pandas and read the data into a DataFrame. Print the first 5 rows of the DataFrame.

In [10]:
import pandas as pd

In [11]:
data = pd.read_csv(r"C:\Users\neela\Downloads\padas_question.csv")

In [39]:
data

      Name  Gender  Age  Height (cm)  Weight (kg)         City        BMI
0    Alice  Female   25          165           58     New York  21.303949
1      Bob    Male   30          180           80  Los Angeles  24.691358
2  Charlie    Male   35          175           70      Chicago  22.857143
3    Diana  Female   28          170           65        Miami  22.491349
4      Eva  Female   27          175           60     New York  19.591837
5    Frank    Male   40          190           85      Houston  23.545706
6    Grace  Female   32          168           55      Chicago  19.486961
7    Henry    Male   45          175           75  Los Angeles  24.489796
8      Ivy  Female   26          172           63        Miami  21.295295
9     Jack    Male   28          180           78     New York  24.074074

In [13]:
data.head()

      Name  Gender  Age  Height (cm)  Weight (kg)         City
0    Alice  Female   25          165           58     New York
1      Bob    Male   30          180           80  Los Angeles
2  Charlie    Male   35          175           70      Chicago
3    Diana  Female   28          170           65        Miami
4      Eva  Female   27          175           60     New York

2. Print the number of rows and columns in the DataFrame.

In [25]:
print("Number of rows and columns in the DataFrame:")
data.shape

Number of rows and columns in the DataFrame:

(10, 7)

3. Print the null value count

In [15]:
data.isnull().sum()

Name           0
Gender         0
Age            0
Height (cm)    0
Weight (kg)    0
City           0
dtype: int64

4. Print the average age, height, and weight of the people in the DataFrame

In [38]:
print("Average Age:",data['Age'].mean())
print("Average Height:", data['Height (cm)'].mean())
print("Average Weight:", data['Weight (kg)'].mean())

Average Age: 31.6
Average Height: 175.0
Average Weight: 68.9

5. Print the name and city of the person who is the tallest in the DataFrame.

In [17]:
tallest_person = data.loc[data['Height (cm)'].idxmax()]
tallest_person[['Name', 'City']]

Name      Frank
City    Houston
Name: 5, dtype: object

6. Create a new column in the DataFrame called "BMI" that calculates the body mass index of each person. BMI is
calculated as weight (kg) divided by height (m) squared. Print the DataFrame with the new column.

In [18]:
data['BMI'] = data['Weight (kg)'] / ((data['Height (cm)'] / 100) ** 2)
data

      Name  Gender  Age  Height (cm)  Weight (kg)         City        BMI
0    Alice  Female   25          165           58     New York  21.303949
1      Bob    Male   30          180           80  Los Angeles  24.691358
2  Charlie    Male   35          175           70      Chicago  22.857143
3    Diana  Female   28          170           65        Miami  22.491349
4      Eva  Female   27          175           60     New York  19.591837
5    Frank    Male   40          190           85      Houston  23.545706
6    Grace  Female   32          168           55      Chicago  19.486961
7    Henry    Male   45          175           75  Los Angeles  24.489796
8      Ivy  Female   26          172           63        Miami  21.295295
9     Jack    Male   28          180           78     New York  24.074074

7. Group the data by gender and print the average age, height, and weight of males and females separately.

In [19]:
grouped_data = data.groupby('Gender').agg({'Age': 'mean', 'Height (cm)': 'mean', 'Weight (kg)': 'mean'})
grouped_data

         Age  Height (cm)  Weight (kg)
Gender
Female  27.6        170.0         60.2
Male    35.6        180.0         77.6

8. Sort the data by age in ascending order and print the first 3 rows of the sorted DataFrame.

In [20]:
sorted_data = data.sort_values(by='Age', ascending=True)
sorted_data.head(3)

    Name  Gender  Age  Height (cm)  Weight (kg)      City        BMI
0  Alice  Female   25          165           58  New York  21.303949
8    Ivy  Female   26          172           63     Miami  21.295295
4    Eva  Female   27          175           60  New York  19.591837

9. Filter the data to only include people who live in New York and print the resulting DataFrame

In [21]:
newyork_data = data[data['City'] == 'New York']
newyork_data

    Name  Gender  Age  Height (cm)  Weight (kg)      City        BMI
0  Alice  Female   25          165           58  New York  21.303949
4    Eva  Female   27          175           60  New York  19.591837
9   Jack    Male   28          180           78  New York  24.074074